"""
1) Час хисткий і непевний.
2) Синій птах з перебитими крилами.
3) В Америці все ніяк не виберуть президента.
4) Почуваю себе засмиканим з усіх боків.
5) Якось треба зібратися з духом, налаштуватись морально.

Відповіді:


Установіть відповідність між видом односкладного речення та його прикладом

1) Час хисткий і непевний.
2) Синій птах з перебитими крилами.
3) В Америці все ніяк не виберу
Складним є речення:
1) Вода, мабуть, тепла, а дощ, як душ у бані, так і обливає їх.
2) Ось Федько підставляє лице під дощ, ловить краплі ротом.
3) Толя тихенько хреститься й блідніє, але од вікна одійти не може.
4) Нарешті, Федько помічає Толю і почина махати рукою, закликаючи до себе.
5) Васько і Стьопка теж вимахують, показують підкови, гвіздки, пацають ногами, підскакуютьть президента.
4) Почуваю себе засмиканим з усіх боків.
5) Якось треба зібратися з духом, налаштуватись морально.

a) означено-особове
b) неозначено-особове
c) називне
d) безособове






"""